[

  { "_id": "A101", "title": "Propulsion Assignment", "course": "RS101",
 "description": "This section includes the homework assignments and solutions for the course including an optional assignment on heat transfer.", 
 "points": 30, 
 "availableDate": "2024-05-06", "availableTime": "12:00am",
 "dueDate": "2024-05-13", "dueTime": "11:59pm"
  },

  { "_id": "A102", "title": "Combustion Analysis", "course": "RS101", 
  "description": "Combustion analysis is a method used in both organic chemistry and analytical chemistry to determine the elemental composition (more precisely empirical formula) of a pure organic compound by combusting the sample under conditions where the resulting combustion products can be quantitatively analyzed.", 
  "points": 50, 
  "availableDate": "2024-05-13", "availableTime": "3:00am",
  "dueDate": "2024-05-20", "dueTime": "10:59pm"
   },

  { "_id": "A103", "title": "Nozzle Design Project", "course": "RS101", 
  "description": "A nozzle is a relatively simple device, just a specially shaped tube through which hot gases flow. Ramjets and rockets typically use a fixed convergent section followed by a fixed divergent section for the design of the nozzle.", 
  "points": 60, 
  "availableDate": "2024-05-20", "availableTime": "6:00am",
  "dueDate": "2024-05-27", "dueTime": "9:59pm"
   },


  { "_id": "A201", "title": "Aerodynamics Quiz", "course": "RS102", 
  "description": "As much as it seems sometimes that airplanes fly by magic, it’s important for every pilot to understand at least the basic fundamentals of aerodynamics. These principles dictate not only how the aircraft stays aloft, but what makes it either stable or unstable.", 
  "points": 30, 
  "availableDate": "2024-06-06", "availableTime": "5:00am",
  "dueDate": "2024-06-13", "dueTime": "2:59pm" 
},

  { "_id": "A202", "title": "Flow Analysis", "course": "RS102", 
  "description": "Flow analysis assesses the flow of data or control within a program, helping identify potential issues such as security vulnerabilities or performance bottlenecks. It is crucial for understanding and optimizing the behavior of software applications.", 
  "points": 40, 
  "availableDate": "2024-06-13", "availableTime": "7:00am",
  "dueDate": "2024-06-20", "dueTime": "4:59pm" 
},

  { "_id": "A203", "title": "Heating Analysis", "course": "RS102", 
  "description": "Heating analysis is a general term defining a technique used to analyze the time and temperature at which physical changes occur when a substance is heated or cooled.", 
  "points": 40, 
  "availableDate": "2024-06-20", "availableTime": "9:00am",
  "dueDate": "2024-06-27", "dueTime": "8:59pm"
 },


  { "_id": "A301", "title": "Structural Design Task", "course": "RS103", 
  "description": "Structural designers understand how to sketch, model and edit project layouts during a project. In addition to creating initial and improved sketches for project blueprints, they also understand how to use Building Information Modeling (BIM) software to create 3D models of each part of a building.", 
  "points": 50, 
  "availableDate": "2024-07-06", "availableTime": "1:00am",
  "dueDate": "2024-07-13", "dueTime": "6:59pm"
 },

  { "_id": "A302", "title": "Orbital Calculations", "course": "RS103", 
  "description": "Orbital mechanics or astrodynamics is the application of ballistics and celestial mechanics to the practical problems concerning the motion of rockets, satellites, and other spacecraft. ", 
  "points": 50, 
  "availableDate": "2024-07-13", "availableTime": "4:00am",
  "dueDate": "2024-07-20", "dueTime": "8:59pm"
 },

  { "_id": "A303", "title": "Systems Engineering Exam", "course": "RS103", 
  "description": "The INCOSE knowledge exam is a multiple-choice test based on the INCOSE Systems Engineering Handbook. It is required for candidates for ASEP and CSEP certification, unless they have taken an alternate route such as Academic Equivalency Applying for ASEP or CSEP automatically enrolls you to take the computer exam.", 
  "points": 100, 
  "availableDate": "2024-07-20", "availableTime": "7:00am",
  "dueDate": "2024-07-27", "dueTime": "10:59pm"
 }

]
